In [1]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]
import sqlite3
import pandas as pd

con = sqlite3.connect('Employee2.sqlite')
df = pd.DataFrame({'employee_id': employee_id , 'name' : name , 'age' : age, 'department' : department, 'salary':salary})
df.to_sql('Employee_Detail', con)
print("Done")

Done

In [3]:
df

    employee_id       name  age      department  salary
0           101    Aadarsh   25       Marketing   50000
1           102      Aarti   27      Operations   60000
2           103  Siddharth   25         Finance   85000
3           104       Aman   24  Human Resource   75000
4           105       Amit   30       Marketing   50000
5           106   Shivansh   26              IT   90000
6           107    Vaibhav   23         Finance   85000
7           108   Himanshu   26              IT   90000
8           109      Raman   25      Operations   60000
9           110      Kunal   26       Marketing   50000
10          111     Adhira   29  Human Resource   75000
11          112      Tanya   24       Marketing   50000

In [ ]:
## find out the no. of employee working in each department

In [2]:
cur=con.cursor()
cur.execute('Select * from Employee_Detail')
dic={}
for i in cur:
    if i[4] not in dic:
        dic[i[4]]=1
    else:
        dic[i[4]]+=1
for i in dic:
    print(i,dic[i])

Marketing 4
Operations 2
Finance 2
Human Resource 2
IT 2

In [ ]:
## find average salary for each department

In [4]:
cur.execute("SELECT department, AVG(salary) FROM Employee_Detail GROUP BY department")
for row in cur.fetchall():
    print(row)

('Finance', 85000.0)
('Human Resource', 75000.0)
('IT', 90000.0)
('Marketing', 50000.0)
('Operations', 60000.0)

In [ ]:
##List All Employees Older Than 25

In [5]:
cur.execute("SELECT * FROM Employee_Detail WHERE age > 25")
for row in cur.fetchall():
    print(row)

(1, 102, 'Aarti', 27, 'Operations', 60000)
(4, 105, 'Amit', 30, 'Marketing', 50000)
(5, 106, 'Shivansh', 26, 'IT', 90000)
(7, 108, 'Himanshu', 26, 'IT', 90000)
(9, 110, 'Kunal', 26, 'Marketing', 50000)
(10, 111, 'Adhira', 29, 'Human Resource', 75000)

In [ ]:
##Find the Total Number of Employees in Each Department

In [6]:
cur.execute("SELECT department, COUNT(*) FROM Employee_Detail GROUP BY department")
for row in cur.fetchall():
    print(row)

('Finance', 2)
('Human Resource', 2)
('IT', 2)
('Marketing', 4)
('Operations', 2)

In [ ]:
##Retrieve Employees Earning More Than 70,000

In [7]:
cur.execute("SELECT * FROM Employee_Detail WHERE salary > 70000")
for row in cur.fetchall():
    print(row)

(2, 103, 'Siddharth', 25, 'Finance', 85000)
(3, 104, 'Aman', 24, 'Human Resource', 75000)
(5, 106, 'Shivansh', 26, 'IT', 90000)
(6, 107, 'Vaibhav', 23, 'Finance', 85000)
(7, 108, 'Himanshu', 26, 'IT', 90000)
(10, 111, 'Adhira', 29, 'Human Resource', 75000)

In [ ]:
##Get the Maximum Salary in Each Department

In [8]:
cur.execute("SELECT department, MAX(salary) FROM Employee_Detail GROUP BY department")
for row in cur.fetchall():
    print(row)

('Finance', 85000)
('Human Resource', 75000)
('IT', 90000)
('Marketing', 50000)
('Operations', 60000)

In [ ]:
## List Departments with More Than 2 Employees

In [9]:
cur.execute("SELECT department, COUNT(*) FROM Employee_Detail GROUP BY department HAVING COUNT(*) > 2")
for row in cur.fetchall():
    print(row)

('Marketing', 4)

In [ ]:
##Find Employees with ‘IT’ Department

In [10]:
cur.execute("SELECT * FROM Employee_Detail WHERE department = 'IT'")
for row in cur.fetchall():
    print(row)

(5, 106, 'Shivansh', 26, 'IT', 90000)
(7, 108, 'Himanshu', 26, 'IT', 90000)

In [ ]:
##Calculate the Sum of Salaries in the Marketing Department

In [11]:
cur.execute("SELECT SUM(salary) FROM Employee_Detail WHERE department = 'Marketing'")
result = cur.fetchone()
print(result[0])

200000

In [ ]:
##Display Employee Details Sorted by Age

In [12]:
cur.execute("SELECT * FROM Employee_Detail ORDER BY age")
for row in cur.fetchall():
    print(row)

(6, 107, 'Vaibhav', 23, 'Finance', 85000)
(3, 104, 'Aman', 24, 'Human Resource', 75000)
(11, 112, 'Tanya', 24, 'Marketing', 50000)
(0, 101, 'Aadarsh', 25, 'Marketing', 50000)
(2, 103, 'Siddharth', 25, 'Finance', 85000)
(8, 109, 'Raman', 25, 'Operations', 60000)
(5, 106, 'Shivansh', 26, 'IT', 90000)
(7, 108, 'Himanshu', 26, 'IT', 90000)
(9, 110, 'Kunal', 26, 'Marketing', 50000)
(1, 102, 'Aarti', 27, 'Operations', 60000)
(10, 111, 'Adhira', 29, 'Human Resource', 75000)
(4, 105, 'Amit', 30, 'Marketing', 50000)

In [ ]:
##Find Employees in the ‘Finance’ and ‘IT’ Departments

In [13]:
cur.execute("SELECT * FROM Employee_Detail WHERE department IN ('Finance', 'IT')")
for row in cur.fetchall():
    print(row)

(2, 103, 'Siddharth', 25, 'Finance', 85000)
(5, 106, 'Shivansh', 26, 'IT', 90000)
(6, 107, 'Vaibhav', 23, 'Finance', 85000)
(7, 108, 'Himanshu', 26, 'IT', 90000)